package HW13;
/*
Создать класс Spam, который получает массив интервалов времени в миллисекундах и согласованный с ним массив сообщений,
и выводит соответствующие сообщения на экран через заданные интервалы времени. По нажатию на клавишу Enter приложение
должно завершать свою работу (данную функциональность поместить в метод Spam.main). При демонстрации работы смоделировать
ввод Enter через 5 сек (данную функциональность поместить в метод Part2.main).

 */
public class Spam {
    public static void main(String[] args) {

    }
}
