package HW8;
/*
Задание:

Написать метод, который принимает директорию, и расширения файла.
Подсчитать общее количество файлов с заданным расширением рекурсивно начиная от этой директории.

Одна из целей: потренироваться писать рекурсивные методы.


Практиковаться с классом Files. Разобраться в отличии Files.find, Files.walk + filter, Files.list

Найти файлы с расширением .java
В методе принимается инт глубины поиска
Пас, откуда искать
Вывести в консоль конкатенированую строку всех названий файлов

 */

public class File {

}
